---
kind: type
id: T:Autodesk.Revit.DB.ViewTemplateApplicationOption
source: html/e844d7b8-0e29-cd97-d6b4-36b57ba050fd.htm
---
# Autodesk.Revit.DB.ViewTemplateApplicationOption

Options for applying view templates

## Syntax (C#)
```csharp
public enum ViewTemplateApplicationOption
```